/*******************************************************************************
  * @file    MyLib.c 
  * @author  yangxd
  * @version V 0.01
  * @date    2013.11.25
  * @brief   一些常用的函数
  ******************************************************************************
  * @attention
  *
  *
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "MyLib.h"
/* Private macro -------------------------------------------------------------*/
#define		INT_DIGITS		19			//有符号长整型除符号外最长19位
/* Private variables ---------------------------------------------------------*/
static char g_chrbuf[INT_DIGITS + 2];	//数据长度再加一个符号位和一个结束符	
/* Private functions ---------------------------------------------------------*/


/******************************************************************************
  * @brief  长整型转换为字符串
  * @param  i：输入的长整型数据
  * @retval 输出字符串指针，以'\0'结束 
******************************************************************************/
char *Lib_LonToChr(long int i)
{
	char *p = g_chrbuf + INT_DIGITS + 1;
	*--p = '\0';							//字符以'\0'结束	       
  	if (i >= 0) 
  	{
		do 
		{
			*--p = '0' + (char)(i % 10);
			i /= 10;
		} while (i != 0);
  	}
  	else 
  	{ 
		do 
		{
			*--p = '0' - (char)(i % 10);
			i /= 10;
		} while (i != 0);
		*--p = '-';
  	}
  	return p;
}
//void  Lib_IntToStr(long int i, char *buf)
//{
//	char *converted;
//
//	converted = Lib_LonToChr(i);
//	strcpy(buf, converted);
//}
/******************************************************************************
  * @brief  字符串转换为长整型
  * @param  chr：输入的字符串指针
  * @retval 输出的长整型数据
******************************************************************************/
long Lib_ChrToLon(char *chr)
{
	int i,len=0;
	long l=0;
	int	sign = 0;

	while (*chr != '\0')				
	{
		chr++;
		len++;
	}
	chr = chr - len;
	if(*chr == '-')
	{
		sign = 1;
		chr++;
		len--;
	}
	for (i=0; i<len; i++) 
	{
		if ((*(chr+i) >= '0') && (*(chr+i) <= '9')) 
		{
			l *= 10;
			l += *(chr+i) - '0';
		}
	}
	if(sign)l = 0 - l;
	return l;
}
/******************************************************************************
  * @brief  浮点型转换为字符串
  * @param  f：输入的浮点型数据
  * @retval 输出字符串指针，以'\0'结束 
******************************************************************************/
char *Lib_FloatToChr(float f)
{
	int	rlen = sprintf ((char *)g_chrbuf,"%f\0",f);
	if(rlen > 20)g_chrbuf[20]='\0';
  	return g_chrbuf;
}
/******************************************************************************
  * @brief  字符串转换为浮点型
  * @param  chr：输入的字符串指针
  * @retval 输出浮点型数据
******************************************************************************/
float Lib_ChrToFloat(char *chr)
{
	int i,len=0;
	float f = 0.0;
	float fl = 1.0;
	int	sign = 0;
	int	dot = 0;

	while (*chr != '\0')				
	{
		chr++;
		len++;
	}
	chr = chr - len;
	if(*chr == '-')							//是否为负数
	{
		sign = 1;
		chr++;
		len--;
	}
	for (i=0; i<len; i++) 
	{
		if ((*(chr+i) >= '0') && (*(chr+i) <= '9')) 
		{
			if(dot == 0)					//小数点左
			{
				f *= 10;
				f += *(chr+i) - '0';
			}
			else							//小数点右
			{
				fl /= 10.0;
				f += (*(chr+i) - '0')*fl;	
			}
		}
		else if(*(chr+i) == '.')			//小数点
		{
			dot = 1;
		}
	}
	if(sign)f = 0.0 - f;					//负数
	return f;
}
